---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofStructureIdParam
source: html/7c2b2445-2a8c-e4ec-0b65-916ba3b9c58e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofStructureIdParam Property

"Structure"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofStructureIdParam { get; }
```